run/cokeCombustion/T673_Pe1e-3_modifiedRPM/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e+06;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 1e+06;
    }
    top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 1e+06;
    }
    bottom
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 1e+06;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
